logs/fio-diskrnd/GWDG 4v 8GB/000/log005.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;183509;716;91424;0;0;0.000000;0.000000;88;159744;1381.306942;3844.255266;1.000000%=93;5.000000%=97;10.000000%=125;20.000000%=173;30.000000%=177;40.000000%=183;50.000000%=189;60.000000%=197;70.000000%=207;80.000000%=234;90.000000%=8978;95.000000%=10682;99.000000%=14614;99.500000%=14614;99.900000%=15007;99.950000%=15138;99.990000%=102236;0%=0;0%=0;0%=0;92;159750;1387.219877;3844.276556;146944;1987584;100.000000%;183622.329670;137435.947758;0.136727%;14.653862%;7056;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;5.64%;77.35%;6.77%;0.12%;0.01%;0.01%;0.03%;0.76%;9.29%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;45274;0;167;0;4366536;4367773;99.18%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=6875: Sun Jan  7 18:41:35 2024
  write: IOPS=716, BW=179MiB/s (188MB/s)(16.0GiB/91424msec); 0 zone resets
    clat (usec): min=88, max=159744, avg=1381.31, stdev=3844.26
     lat (usec): min=92, max=159750, avg=1387.22, stdev=3844.28
    clat percentiles (usec):
     |  1.00th=[    94],  5.00th=[    98], 10.00th=[   126], 20.00th=[   174],
     | 30.00th=[   178], 40.00th=[   184], 50.00th=[   190], 60.00th=[   198],
     | 70.00th=[   208], 80.00th=[   235], 90.00th=[  8979], 95.00th=[ 10683],
     | 99.00th=[ 14615], 99.50th=[ 14615], 99.90th=[ 15008], 99.95th=[ 15139],
     | 99.99th=[102237]
   bw (  KiB/s): min=146944, max=1987584, per=100.00%, avg=183622.33, stdev=137435.95, samples=182
   iops        : min=  574, max= 7764, avg=717.27, stdev=536.86, samples=182
  lat (usec)   : 100=5.64%, 250=77.35%, 500=6.77%, 750=0.12%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%, 10=0.76%, 20=9.29%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.14%, sys=14.65%, ctx=7056, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=179MiB/s (188MB/s), 179MiB/s-179MiB/s (188MB/s-188MB/s), io=16.0GiB (17.2GB), run=91424-91424msec

Disk stats (read/write):
  vda: ios=0/45274, merge=0/167, ticks=0/4366536, in_queue=4367773, util=99.18%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;56120;219;298948;0;0;0.000000;0.000000;2160;218971;4551.466518;4714.817010;1.000000%=2703;5.000000%=2932;10.000000%=3063;20.000000%=3293;30.000000%=3457;40.000000%=3620;50.000000%=3784;60.000000%=3948;70.000000%=4145;80.000000%=4423;90.000000%=5472;95.000000%=8290;99.000000%=21626;99.500000%=27131;99.900000%=47972;99.950000%=56360;99.990000%=212860;0%=0;0%=0;0%=0;2160;218971;4551.816871;4714.818635;6144;76800;100.000000%;56145.157454;9764.441658;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.142166%;3.966255%;66291;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;63.01%;33.19%;2.60%;1.11%;0.06%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65520;2854;0;7;288036;191224;479302;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=6879: Sun Jan  7 18:46:35 2024
  read: IOPS=219, BW=54.8MiB/s (57.5MB/s)(16.0GiB/298948msec)
    clat (msec): min=2, max=218, avg= 4.55, stdev= 4.71
     lat (msec): min=2, max=218, avg= 4.55, stdev= 4.71
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    6], 95.00th=[    9],
     | 99.00th=[   22], 99.50th=[   28], 99.90th=[   48], 99.95th=[   57],
     | 99.99th=[  213]
   bw (  KiB/s): min= 6144, max=76800, per=100.00%, avg=56145.16, stdev=9764.44, samples=597
   iops        : min=   24, max=  300, avg=219.27, stdev=38.15, samples=597
  lat (msec)   : 4=63.01%, 10=33.19%, 20=2.60%, 50=1.11%, 100=0.06%
  lat (msec)   : 250=0.02%
  cpu          : usr=0.14%, sys=3.97%, ctx=66291, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=54.8MiB/s (57.5MB/s), 54.8MiB/s-54.8MiB/s (57.5MB/s-57.5MB/s), io=16.0GiB (17.2GB), run=298948-298948msec

Disk stats (read/write):
  vda: ios=65520/2854, merge=0/7, ticks=288036/191224, in_queue=479302, util=100.00%