logs/fio-diskrnd/GWDG 4v 8GB/000/log007.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;183638;717;91360;0;0;0.000000;0.000000;88;171965;1380.430573;3869.556481;1.000000%=91;5.000000%=99;10.000000%=125;20.000000%=173;30.000000%=179;40.000000%=183;50.000000%=189;60.000000%=197;70.000000%=209;80.000000%=234;90.000000%=8454;95.000000%=10682;99.000000%=14614;99.500000%=14614;99.900000%=15138;99.950000%=16908;99.990000%=108527;0%=0;0%=0;0%=0;92;171971;1386.179888;3869.559668;146432;1956864;100.000000%;183740.483516;135451.394650;0.505697%;14.253659%;7500;0;13;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;4.97%;78.15%;6.72%;0.07%;0.02%;0.01%;0.04%;0.72%;9.28%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;45120;0;148;0;4351922;4353174;99.19%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=6914: Sun Jan  7 18:55:01 2024
  write: IOPS=717, BW=179MiB/s (188MB/s)(16.0GiB/91360msec); 0 zone resets
    clat (usec): min=88, max=171965, avg=1380.43, stdev=3869.56
     lat (usec): min=92, max=171971, avg=1386.18, stdev=3869.56
    clat percentiles (usec):
     |  1.00th=[    92],  5.00th=[   100], 10.00th=[   126], 20.00th=[   174],
     | 30.00th=[   180], 40.00th=[   184], 50.00th=[   190], 60.00th=[   198],
     | 70.00th=[   210], 80.00th=[   235], 90.00th=[  8455], 95.00th=[ 10683],
     | 99.00th=[ 14615], 99.50th=[ 14615], 99.90th=[ 15139], 99.95th=[ 16909],
     | 99.99th=[108528]
   bw (  KiB/s): min=146432, max=1956864, per=100.00%, avg=183740.48, stdev=135451.39, samples=182
   iops        : min=  572, max= 7644, avg=717.74, stdev=529.11, samples=182
  lat (usec)   : 100=4.97%, 250=78.15%, 500=6.72%, 750=0.07%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.04%, 10=0.72%, 20=9.28%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.51%, sys=14.25%, ctx=7500, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=179MiB/s (188MB/s), 179MiB/s-179MiB/s (188MB/s-188MB/s), io=16.0GiB (17.2GB), run=91360-91360msec

Disk stats (read/write):
  vda: ios=0/45120, merge=0/148, ticks=0/4351922, in_queue=4353174, util=99.19%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;53279;208;314890;0;0;0.000000;0.000000;2141;224130;4794.430945;5329.149073;1.000000%=2703;5.000000%=2932;10.000000%=3096;20.000000%=3293;30.000000%=3457;40.000000%=3653;50.000000%=3784;60.000000%=3948;70.000000%=4145;80.000000%=4489;90.000000%=5865;95.000000%=9764;99.000000%=26083;99.500000%=31588;99.900000%=54263;99.950000%=63176;99.990000%=210763;0%=0;0%=0;0%=0;2141;224130;4794.774356;5329.152364;1536;70144;100.000000%;53310.766296;10677.434831;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.139414%;3.754656%;66374;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;62.13%;32.99%;3.02%;1.72%;0.11%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65471;2945;0;12;303826;196708;500644;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=6919: Sun Jan  7 19:00:16 2024
  read: IOPS=208, BW=52.0MiB/s (54.6MB/s)(16.0GiB/314890msec)
    clat (msec): min=2, max=224, avg= 4.79, stdev= 5.33
     lat (msec): min=2, max=224, avg= 4.79, stdev= 5.33
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    6], 95.00th=[   10],
     | 99.00th=[   27], 99.50th=[   32], 99.90th=[   55], 99.95th=[   64],
     | 99.99th=[  211]
   bw (  KiB/s): min= 1536, max=70144, per=100.00%, avg=53310.77, stdev=10677.43, samples=629
   iops        : min=    6, max=  274, avg=208.17, stdev=41.69, samples=629
  lat (msec)   : 4=62.13%, 10=32.99%, 20=3.02%, 50=1.72%, 100=0.11%
  lat (msec)   : 250=0.02%
  cpu          : usr=0.14%, sys=3.75%, ctx=66374, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=52.0MiB/s (54.6MB/s), 52.0MiB/s-52.0MiB/s (54.6MB/s-54.6MB/s), io=16.0GiB (17.2GB), run=314890-314890msec

Disk stats (read/write):
  vda: ios=65471/2945, merge=0/12, ticks=303826/196708, in_queue=500644, util=100.00%